correct_data_1 = {"name": "Декрет"}
correct_data_2 = {"name": "О"}
correct_data_3 = {"name": "Это строка длиной ровно 150 символов. Это строка длиной ровно 150 символов. Это строка длиной ровно 150 символов. Это строка длиной ровно 150 символов"} # noqa
correct_data_4 = {"name": "Отпуск по уходу за ребенком"}
correct_data_5 = {"name": "1234567890"}

incorrect_data_1 = {"name": ""}
incorrect_data_2 = {"name": "Это строка длиной более 150 символов. Это строка длиной более 150 символов. Это строка длиной более 150 символов. Это строка длиной более 150 символов. Это строка длиной более 150 символов."} # noqa
incorrect_data_3 = {"name": None}
incorrect_data_4 = {"name": 12345}
incorrect_data_5 = {"name": " "}
